In [1]:
import pandas as pd
data = [
    [60,65,66],
    [80,85,88],
    [100,100,100]
]
col = ["国語","数学","英語"]
idx = ["A太","B助","C子"]

df = pd.DataFrame(data,columns = col, index = idx)
df

     国語   数学   英語
A太   60   65   66
B助   80   85   88
C子  100  100  100

## データが科目ごとに提示されている場合

In [2]:
data = {
    "国語": [60,80,100],
    "数学": [65,85,100],
    "英語": [66,88,100]
}
idx = ["A太","B助","C太"]
df = pd.DataFrame(data, index=idx)
df

     国語   数学   英語
A太   60   65   66
B助   80   85   88
C太  100  100  100

In [3]:
print(data)

{'国語': [60, 80, 100], '数学': [65, 85, 100], '英語': [66, 88, 100]}

In [17]:
test_csv = "python2nen_databunseki_sample/test.csv"
#DataFrame = pd.read_csv(test_csv,index_col = 0)
DataFrame = pd.read_csv(test_csv,index_col = 0,header=None)
df

     国語   数学   英語
A太   60   65   66
B助   80   85   88
C太  100  100  100

In [18]:
import pandas as pd
df = pd.read_csv(test_csv,index_col=0)
df.head()

     国語  数学  英語  学生番号
名前
A太   83  89  76  A001
B介   66  93  75  B001
C子  100  84  96  B002
D郎   60  73  40  A002
E美   92  62  84  C001

In [19]:
df.columns

Index(['国語', '数学', '英語', '学生番号'], dtype='object')

In [20]:
df.index

Index(['A太', 'B介', 'C子', 'D郎', 'E美', 'F菜'], dtype='object', name='名前')

In [23]:
list1 = [i for i in df.columns]
print(list1)

list2 = [i for i in df.index]
print(list2)

['国語', '数学', '英語', '学生番号']
['A太', 'B介', 'C子', 'D郎', 'E美', 'F菜']

In [24]:
df.dtypes

国語       int64
数学       int64
英語       int64
学生番号    object
dtype: object

In [25]:
len(df)

6

In [33]:
df[["国語","数学","英語"]]

     国語  数学  英語
名前
A太   83  89  76
B介   66  93  75
C子  100  84  96
D郎   60  73  40
E美   92  62  84
F菜   96  92  94

In [35]:
df.iloc[2]

国語       100
数学        84
英語        96
学生番号    B002
Name: C子, dtype: object

In [36]:
df.iloc[[0,3]]

    国語  数学  英語  学生番号
名前
A太  83  89  76  A001
D郎  60  73  40  A002

In [37]:
df.iloc[0]["国語"]

83

In [40]:
import pandas as pd
dfA = pd.read_csv(test_csv, index_col=0)

dfB = pd.DataFrame()
dfB["国語"] = dfA["国語"]
dfB

     国語
名前
A太   83
B介   66
C子  100
D郎   60
E美   92
F菜   96

In [42]:
dfA = pd.read_csv(test_csv, index_col = 0)

dfB = pd.DataFrame()
dfB = dfB.append(dfA.iloc[0])
dfB

      国語  学生番号    数学    英語
A太  83.0  A001  89.0  76.0

In [43]:
dfA = pd.read_csv(test_csv, index_col = 0)
dfA = dfA.drop("国語", axis=1)
dfA

    数学  英語  学生番号
名前
A太  89  76  A001
B介  93  75  B001
C子  84  96  B002
D郎  73  40  A002
E美  62  84  C001
F菜  92  94  C002

In [44]:
dfA = pd.read_csv(test_csv, index_col=0)
dfA = dfA.drop(dfA.index[3])
dfA

     国語  数学  英語  学生番号
名前
A太   83  89  76  A001
B介   66  93  75  B001
C子  100  84  96  B002
E美   92  62  84  C001
F菜   96  92  94  C002

In [45]:
import pandas as pd
dfA = pd.read_csv(test_csv, index_col=0)
dfA["国語"] > 80

名前
A太     True
B介    False
C子     True
D郎    False
E美     True
F菜     True
Name: 国語, dtype: bool

In [46]:
dfB = dfA[dfA["国語"] > 80]
dfB

     国語  数学  英語  学生番号
名前
A太   83  89  76  A001
C子  100  84  96  B002
E美   92  62  84  C001
F菜   96  92  94  C002

In [48]:
dfB = dfA[(dfA["国語"] > 80) & (dfA["数学"] > 80)]
dfB

     国語  数学  英語  学生番号
名前
A太   83  89  76  A001
C子  100  84  96  B002
F菜   96  92  94  C002

In [49]:
import pandas as pd 
data = {
    "国語":[90,50,None,40],
    "数学":[80,None,None,50]
}
idx = ["A太","B介","C子","D郎"]
dfA = pd.DataFrame(data, index=idx)
dfA

      国語    数学
A太  90.0  80.0
B介  50.0   NaN
C子   NaN   NaN
D郎  40.0  50.0

In [50]:
dfA.isnull().sum()

国語    1
数学    2
dtype: int64

In [51]:
dfB = dfA.dropna()
dfB

      国語    数学
A太  90.0  80.0
D郎  40.0  50.0

In [52]:
dfB = dfA.dropna(subset=["国語"])
dfB

      国語    数学
A太  90.0  80.0
B介  50.0   NaN
D郎  40.0  50.0

In [53]:
dfB = dfA.fillna(dfA.mean())
dfB

      国語    数学
A太  90.0  80.0
B介  50.0  65.0
C子  60.0  65.0
D郎  40.0  50.0

In [54]:
dfB = dfA.fillna(method='ffill')
dfB

      国語    数学
A太  90.0  80.0
B介  50.0  80.0
C子  50.0  80.0
D郎  40.0  50.0

In [55]:
import pandas as pd
data = [
    [10,30,40],
    [20,30.40],
    [20,30,40],
    [30,30,50],
    [20,30,40]
]
dfA = pd.DataFrame(data)
dfA

    0     1     2
0  10  30.0  40.0
1  20  30.4   NaN
2  20  30.0  40.0
3  30  30.0  50.0
4  20  30.0  40.0

In [56]:
dfA.duplicated().value_counts()

False    4
True     1
dtype: int64

In [58]:
dfB = dfA.drop_duplicates()
dfB

    0     1     2
0  10  30.0  40.0
1  20  30.4   NaN
2  20  30.0  40.0
3  30  30.0  50.0

In [59]:
import pandas as pd
data = {
    "A":["100","300"],
    "B":["500","1,500"]
}
dfA = pd.DataFrame(data)
dfA

     A      B
0  100    500
1  300  1,500

In [60]:
dfA.dtypes

A    object
B    object
dtype: object

In [61]:
dfA["A"] = dfA["A"].astype(int)
dfA.dtypes

A     int32
B    object
dtype: object

In [62]:
dfA["B"] = dfA["B"].str.replace(",","").astype(int)
dfA.dtypes

A    int32
B    int32
dtype: object

In [63]:
dfA

     A     B
0  100   500
1  300  1500